app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.all.order("id DESC")
---
SELECT `tweets`.* FROM `tweets` ORDER BY id DESC

  def create
    @tweet = Tweet.new(create_params)
    if @tweet.save
---
INSERT INTO `tweets` (`text`, `user_id`, `created_at`, `updated_at`) VALUES ('vdfsaov', 1, '2019-03-30 20:02:03', '2019-03-30 20:02:03')

  def edit
    @tweet = Tweet.find_by(id: params[:id])
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 12 LIMIT 1

  def show
    @tweet = Tweet.find_by(id: params[:id])
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 12 LIMIT 1

  def update
    @tweet = Tweet.find_by(id: params[:id])
    @tweet.text = create_params[:text]
    if @tweet.save
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 12 LIMIT 1
UPDATE `tweets` SET `text` = 'test2aa', `updated_at` = '2019-03-29 21:30:43' WHERE `tweets`.`id` = 12

  def destroy
    @tweet = Tweet.find_by(id: params[:id])
    @tweet.destroy
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 11 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 11